# Pandas
**Pandas is an open source library build on top of NumPy. It allows fast analysis and data cleaning and preparation. (We can say it is python's version of excel or python's version of R dataframes**

### Series

In [1]:
# importing pandas and numpy
import numpy as np
import pandas as pd

In [7]:
# Just creating the objects to work with in order to understand series
labels = ['a','b','c','d']
my_list = [1,2,3,4]
arr = np.array(my_list)
d = {'a':1,'b':2,'c':3}

In [11]:
pd.Series(data = my_list, index = labels)

a    1
b    2
c    3
d    4
dtype: int64

In [12]:
#we can also just specify the name of attributes as far as order is correct
pd.Series(my_list,labels)

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
#by default labels start from 0 as:
pd.Series(labels) 
# it should not be confused here simply we have passed labels list as our data, and labels are given by default

0    a
1    b
2    c
3    d
dtype: object

In [16]:
pd.Series(d) # notice here keys are used as labels and values as data

a    1
b    2
c    3
dtype: int64

### Data in Series and Index of Series
So Series is very similar to numpy (infact it is build on top of numpy). Now what differentiates the NumPy array from a Series is that **Series can have axis labels, meaning it can be indexed by a label instead of just number location**. Series also does not hold only numeric data, it can hold any arbitary python object.
The _key to using an series is understanding its index_. Pandas makes use of these index names or numbers by allowing for fast ups of information (works like a hash table or dictionary.

In [18]:
ser1 = pd.Series([1,2,3,4], index = ['Dubai','London','Germany','Maxico'])
ser1

Dubai      1
London     2
Germany    3
Maxico     4
dtype: int64

In [20]:
ser2 = pd.Series([3,4,2,6],['London','Maxico','Italy','Dubai'])
ser2

London    3
Maxico    4
Italy     2
Dubai     6
dtype: int64

In [22]:
ser1 + ser2 # notice here operation is based on index also, only those data points are added whose index matches in both series

Dubai      7.0
Germany    NaN
Italy      NaN
London     5.0
Maxico     8.0
dtype: float64

### DATAFRAMES
A pandas dataframe is simply a 2 dimensional structure, like a 2 dimensiona array, or a table with rows and columns. Dataframes are workhouse of pandas and are directly inspired by the R programing language. We can think of Dataframe as a bunch of **Series Objects** put together to share the same index.

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy.random import randn
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4),index = 'A B C D E'.split(),columns = 'W X Y Z'.split())

In [10]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [11]:
#Dictionary into dataframe
d = {"calories":[200,300,400],
    "duration":[10,20,30]}
d

{'calories': [200, 300, 400], 'duration': [10, 20, 30]}

In [12]:
dict_df = pd.DataFrame(d)

In [13]:
dict_df

   calories  duration
0       200        10
1       300        20
2       400        30

In [14]:
dict_df = pd.DataFrame(d,index='Day1 Day2 Day3'.split())
dict_df

      calories  duration
Day1       200        10
Day2       300        20
Day3       400        30

**Now we have two dataframes- df and dict_df:** Let's see the operations we can perform on these dataframes.
### Selection and Indexing

In [15]:
dict_df

      calories  duration
Day1       200        10
Day2       300        20
Day3       400        30

In [16]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# Each column in a dataframe is a series object. lets grab the particular column of a dataframe
dict_df['calories']

Day1    200
Day2    300
Day3    400
Name: calories, dtype: int64

In [19]:
#similarly
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [21]:
#we can also get the columns as
dict_df.duration   #but this is not usually recommended

Day1    10
Day2    20
Day3    30
Name: duration, dtype: int64

**_Creating/Inserting new column to existing DataFrame_**

In [24]:
dict_df['Work Hours'] = '1hr 2hr 3hr'.split()

In [25]:
dict_df

      calories  duration Work Hours
Day1       200        10        1hr
Day2       300        20        2hr
Day3       400        30        3hr

In [26]:
## Or we can do this
df['AddXY'] = df['X'] + df['Y']
df

          W         X         Y         Z     AddXY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

**_Removing or Dropping Columns_**

In [29]:
df.drop('AddXY',axis = 1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

AddXY column has been dropped from the DataFrame but if  check the DataFrame again , this is not permenantly deleted as seen belowa:

In [30]:
df

          W         X         Y         Z     AddXY
A  2.706850  0.628133  0.907969  0.503826  1.536102
B  0.651118 -0.319318 -0.848077  0.605965 -1.167395
C -2.018168  0.740122  0.528813 -0.589001  1.268936
D  0.188695 -0.758872 -0.933237  0.955057 -1.692109
E  0.190794  1.978757  2.605967  0.683509  4.584725

In order or make the change permenant , we set 'Inplace' attribute to True as:

In [32]:
df.drop('AddXY',axis = 1, inplace = True)

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

**_Dropping Rows_**

In [35]:
# For rows we set axis = 0 which is default also
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [37]:
df.drop('E',axis = 0, inplace = True)

In [38]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

**_Selecting Rows_**

In [41]:
df.loc['A']

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [42]:
#Or select based on position instead of label
df.iloc[0]

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [44]:
# Selecting subset of rows and columns
df.loc['B','X']

-0.31931804459303326

In [45]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

### Conditional Selection
An important feature of pandas is conditional selection using bracket notation, very similiar to numpy

In [46]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [49]:
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True

In [50]:
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057

In [57]:
df[df['W']>0][['X','W']]
# what this single line actually does is
#1. boolser = df['W']>0
#2. result = df[boolser]
#3. my_cols = ['X','Y']
#4. result[my_cols]

          X         W
A  0.628133  2.706850
B -0.319318  0.651118
D -0.758872  0.188695

For two or more conditions we use | and & with parenthesis:

In [62]:
df[(df['W']>1) & (df['Y']>0)]

         W         X         Y         Z
A  2.70685  0.628133  0.907969  0.503826

### More Index Details
We can also reset the index of already existing dataframe and Indexing in dataframe also follows index hierarchy. Lets explore this one out:

In [63]:
dict_df

      calories  duration Work Hours
Day1       200        10        1hr
Day2       300        20        2hr
Day3       400        30        3hr

In [72]:
#Resetting to default
dict_df.reset_index()   # notice previous indicies add up to columns

  index  calories  duration Work Hours
0  Day1       200        10        1hr
1  Day2       300        20        2hr
2  Day3       400        30        3hr

In [73]:
dict_df     # above change is not permenant

      calories  duration Work Hours
Day1       200        10        1hr
Day2       300        20        2hr
Day3       400        30        3hr

In [74]:
new_ind = 'D1 D2 D3'.split()

In [82]:
dict_df['Index'] = new_ind

In [83]:
dict_df.set_index('Index')

       calories  duration Work Hours
Index
D1          200        10        1hr
D2          300        20        2hr
D3          400        30        3hr

In [84]:
dict_df

      calories  duration Work Hours Index
Day1       200        10        1hr    D1
Day2       300        20        2hr    D2
Day3       400        30        3hr    D3

In [85]:
dict_df.set_index('Index',inplace = True)

In [86]:
dict_df

       calories  duration Work Hours
Index
D1          200        10        1hr
D2          300        20        2hr
D3          400        30        3hr

### Multi-Index and Index Hierarchy

In [2]:
import numpy as np
import pandas as pd

In [3]:
from numpy.random import randn
np.random.seed(101)

In [5]:
df = pd.DataFrame(randn(5,4),index = 'A B C D E'.split(), columns = 'W X Y Z'.split())
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [35]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [36]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [39]:
df = pd.DataFrame(randn(6,2),index = hier_index, columns ='A B'.split())
df

             A         B
G1 1  0.666319 -0.538235
   2 -0.568581  1.407338
   3  0.641806 -0.905100
G2 1 -0.391157  1.028293
   2 -1.972605 -0.866885
   3  0.720788 -1.223082

In [38]:
# now lets see how to index this dataframe:
df.loc['G1']

          A         B
1  0.992573  1.192241
2 -1.046780  1.292765
3 -1.467514 -0.494095

In [24]:
df.loc['G1'].loc[1]

A    0.147027
B   -0.479448
Name: 1, dtype: float64

In [25]:
df.index.names

FrozenList([None, None])

In [26]:
df.index.names=['Group','Num']

In [27]:
df

                  A         B
Group Num
G1    1    0.147027 -0.479448
      2    0.558769  1.024810
      3   -0.925874  1.862864
G2    1   -1.133817  0.610478
      2    0.386030  2.084019
      3   -0.376519  0.230336

In [30]:
df.xs('G1')     # xs is cross section ,used when we have multi index

            A         B
Num
1    0.147027 -0.479448
2    0.558769  1.024810
3   -0.925874  1.862864

In [31]:
df.xs(1,level = "Num")   #both groups where level is num and index 1

              A         B
Group
G1     0.147027 -0.479448
G2    -1.133817  0.610478

 # MISSING DATA
 **dropna() and fillna()**
 few methods to deal with missing data in pandas

In [40]:
import numpy as np
import pandas as pd

In [42]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[4,np.nan,np.nan],
                  'C': [3,5,6]})

In [43]:
df

     A    B  C
0  1.0  4.0  3
1  2.0  NaN  5
2  NaN  NaN  6

In [45]:
#Drop missing data
df.dropna()  #default axis=0 hence drops all the rows with NAN's

     A    B  C
0  1.0  4.0  3

In [47]:
df.dropna(axis=1) # as axis = 1 hence drops all the columns with NAN's

   C
0  3
1  5
2  6

In [48]:
#Use of thresh attribute
df.dropna(thresh=2) # drops only those rows with >2 NANs

     A    B  C
0  1.0  4.0  3
1  2.0  NaN  5

In [49]:
df

     A    B  C
0  1.0  4.0  3
1  2.0  NaN  5
2  NaN  NaN  6

In [50]:
# Filling missing Data
df.fillna(value = 'Cancelled')

           A          B  C
0          1          4  3
1          2  Cancelled  5
2  Cancelled  Cancelled  6

In [51]:
# Or we can fill the missing data with some operation on existing data points e.g mean of other datapoints
df['A'].fillna(value = df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GROUPBY
 The groupby method allows us to **group rows of data together and call aggregate functions**

In [53]:
# Create dataframe
data = {'Company':['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
       'Person':['Amie','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [54]:
df = pd.DataFrame(data)

In [55]:
df

     Company   Person  Sales
0     Google     Amie    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

Now we can use the groupby() method to group rows together based off a column. For instance, let's group based off Company.This will create a DataFrameGroupBy object.:

In [56]:
df.groupby('Company')

In [57]:
Comp_grp = df.groupby('Company')

Now we can call groupby aggregate functions on Comp_grp as:

In [59]:
#mean
Comp_grp.mean()

           Sales
Company
Facebook   296.5
Google     160.0
Microsoft  232.0

In [61]:
#standard deviation
Comp_grp.std()

                Sales
Company
Facebook    75.660426
Google      56.568542
Microsoft  152.735065

In [62]:
#max and min
Comp_grp.max()

            Person  Sales
Company
Facebook     Sarah    350
Google     Charlie    200
Microsoft  Vanessa    340

In [63]:
Comp_grp.min()

          Person  Sales
Company
Facebook    Carl    243
Google      Amie    120
Microsoft    Amy    124

In [64]:
#count
Comp_grp.count()

           Person  Sales
Company
Facebook        2      2
Google          2      2
Microsoft       2      2

In [66]:
#describe method
Comp_grp.describe()

          Sales
          count   mean         std    min     25%    50%     75%    max
Company
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [67]:
Comp_grp.describe().transpose()

Company        Facebook      Google   Microsoft
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [77]:
Comp_grp.describe().transpose()['Google']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: Google, dtype: float64

# MERGING , JOINING and CONCATENATION
There are 3 main ways of combining DataFrames together: Merging, Joining and Concatenting.

In [1]:
import pandas as pd

In [2]:
# Creating Dataframes
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

### Concatenation
Concatenation basically glues together DataFrames. But keep in mind that **dimensions should match along the axis you are concatenating on**. We use **pd.concat** and pass in a list of DataFrames to concatenate together:

In [9]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [10]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [12]:
# Again Creating Example Dataframe
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [13]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [14]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

### Merging
The **merge** function allows us to merge DataFrames together using a similiar logic as merging SQL Tables together.
By default it merges on 'inner'. If we would use concat for DataFrames with atleast one similar column , then we will get that column twice in resulting DataFrame, thus merging in convenient.

In [15]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [17]:
# More complicated Example:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [19]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [20]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [23]:
pd.merge(left,right,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [24]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [25]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

### Joining
Joining is convenient method for combining the columns of two potentially different-indexed DataFrames into a single result DataFrame.

In [26]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2'])  

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [27]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [28]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [29]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [30]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

# OPERATIONS
There are lots of operations with pandas that are very useful to us, but don't fall into any distinct category. Lets explore:

In [16]:
import pandas as pd
Employee = pd.DataFrame({'Empid':[101,102,103,104,105],
                        'Emp_Name':'Amie Basit Zaid Noor Aanaa'.split(),
                        'Salary': [20000,14000,20000,25000,14000],
                        'Company':'Google Facebook Amazon Facebook Google'.split()})

In [17]:
Employee.head()  #just diplays the DataFrame

   Empid Emp_Name  Salary   Company
0    101     Amie   20000    Google
1    102    Basit   14000  Facebook
2    103     Zaid   20000    Amazon
3    104     Noor   25000  Facebook
4    105    Aanaa   14000    Google

### Info or Unique Values

In [20]:
# Unique method displays only unique elements
Employee['Company'].unique()

array(['Google', 'Facebook', 'Amazon'], dtype=object)

In [22]:
#nunique() display no. of unique elements
Employee['Company'].nunique()
# we can also do this by: len(Employee['Company'].unique())

3

In [26]:
# value_counts() : this gives us the frequency of elements
Employee['Company'].value_counts()

Facebook    2
Google      2
Amazon      1
Name: Company, dtype: int64

In [27]:
Employee['Salary'].value_counts()

14000    2
20000    2
25000    1
Name: Salary, dtype: int64

### Selecting Data

In [33]:
# Selecting from DataFrame using criteria from multiple columns
#1. From single column
Employee[Employee['Company']=='Google']
# Inside condition return boolean series of dataframe which is then again converted to dataframe by outsider Employee

   Empid Emp_Name  Salary Company
0    101     Amie   20000  Google
4    105    Aanaa   14000  Google

In [34]:
#2. Now from multiple columns as:
Employee[(Employee['Company']=='Facebook') & (Employee['Salary']==25000)]

   Empid Emp_Name  Salary   Company
3    104     Noor   25000  Facebook

### Applying Function
### apply()

In [35]:
def dbl_sal(x):
    return 2*x

In [36]:
Employee['Salary'].apply(dbl_sal)

0    40000
1    28000
2    40000
3    50000
4    28000
Name: Salary, dtype: int64

In [37]:
# we can pass inbuilt functions like len()
Employee['Emp_Name'].apply(len)

0    4
1    5
2    4
3    4
4    5
Name: Emp_Name, dtype: int64

**Other Funcions:**

In [38]:
#sum()
Employee['Salary'].sum()

93000

**Getting Column names and index names**

In [39]:
Employee.columns

Index(['Empid', 'Emp_Name', 'Salary', 'Company'], dtype='object')

In [40]:
Employee.index

RangeIndex(start=0, stop=5, step=1)

**Sorting and Ordering of DataFrames**

In [41]:
Employee

   Empid Emp_Name  Salary   Company
0    101     Amie   20000    Google
1    102    Basit   14000  Facebook
2    103     Zaid   20000    Amazon
3    104     Noor   25000  Facebook
4    105    Aanaa   14000    Google

In [43]:
#sort_values()
Employee.sort_values(by='Salary') #inplace set of False by default

   Empid Emp_Name  Salary   Company
1    102    Basit   14000  Facebook
4    105    Aanaa   14000    Google
0    101     Amie   20000    Google
2    103     Zaid   20000    Amazon
3    104     Noor   25000  Facebook

In [44]:
Employee.sort_values('Salary', ascending = False)

   Empid Emp_Name  Salary   Company
3    104     Noor   25000  Facebook
0    101     Amie   20000    Google
2    103     Zaid   20000    Amazon
1    102    Basit   14000  Facebook
4    105    Aanaa   14000    Google

**Finding Null values or Check for Null values**

In [45]:
#isnull()
Employee.isnull()

   Empid  Emp_Name  Salary  Company
0  False     False   False    False
1  False     False   False    False
2  False     False   False    False
3  False     False   False    False
4  False     False   False    False

# DATA INPUT AND OUPUT
Lets see how to read data from files like: **csv,excel,html,sql** . Pandas can read a variety of file types using its pd.read_methods. And we must ensure first where our file is, if we have file in the same directory then we have to only mention the name of the file, otherwise we have to specify full path of file.

In [47]:
pwd   #return path of working directory

'C:\\Users\\Aamir Malla\\Documents\\Jupyter NoteBook'

### CSV 
**CSV Input**
Reading an csv file and converting it into dataframe.

In [70]:
df = pd.read_csv('ExmplDf.csv') 
df

   P_id  Product_Name  Price    Company  Cmp_id
0   101    Oneplus 9R  40000    Oneplus       1
1   102     Iphone 12  80000      Apple       2
2   103  Realme 8 pro  30000     Realme       3
3   104     Redmi k20  25000      Xiomi       4
4   105    Nokia 3600   9000      Nokia       5
5   106      Moto G60  20000  Motorolla       6
6   107       Vivo v5  15000       Vivo       7
7   108   Oppo Reno 5  17000       Oppo       8

**CSV Output**
Deleting one column of dataframe and saving it as another CSV file.

In [74]:
df.drop('Cmp_id',axis=1,inplace=True)

In [75]:
df

   P_id  Product_Name  Price    Company
0   101    Oneplus 9R  40000    Oneplus
1   102     Iphone 12  80000      Apple
2   103  Realme 8 pro  30000     Realme
3   104     Redmi k20  25000      Xiomi
4   105    Nokia 3600   9000      Nokia
5   106      Moto G60  20000  Motorolla
6   107       Vivo v5  15000       Vivo
7   108   Oppo Reno 5  17000       Oppo

In [85]:
df.to_csv('CsvDFmodify.csv',index=False)  #saving as 'CsvDFmodify'
# Why setting index to false: because it will otherwise take the index column of dataframe and will add that up to columns ,alongwith creating new index

In [86]:
df

   P_id  Product_Name  Price    Company
0   101    Oneplus 9R  40000    Oneplus
1   102     Iphone 12  80000      Apple
2   103  Realme 8 pro  30000     Realme
3   104     Redmi k20  25000      Xiomi
4   105    Nokia 3600   9000      Nokia
5   106      Moto G60  20000  Motorolla
6   107       Vivo v5  15000       Vivo
7   108   Oppo Reno 5  17000       Oppo

In [87]:
# reading new csv as dataframe
pd.read_csv('CsvDFmodify.csv')

   P_id  Product_Name  Price    Company
0   101    Oneplus 9R  40000    Oneplus
1   102     Iphone 12  80000      Apple
2   103  Realme 8 pro  30000     Realme
3   104     Redmi k20  25000      Xiomi
4   105    Nokia 3600   9000      Nokia
5   106      Moto G60  20000  Motorolla
6   107       Vivo v5  15000       Vivo
7   108   Oppo Reno 5  17000       Oppo

### Excel
Pandas can read and write excel files, but this must be kept in mind that it will only import data not the formulas or images.
### Excel input
For reading and writing to excel files , we need to install **openpyxl** library first as; **pip install openpyxl** and after installing it when we want to read an excel file using **pd.read_excel** we must specify engine attribute of this method to **openpyxl** as shown below:

In [7]:
import pandas as pd
import openpyxl

In [8]:
comp = pd.read_excel('company.xlsx',sheet_name='Sheet1',engine='openpyxl')
comp

   Cmp_id Company Name  Pid
0     101      Oneplus    1
1     102        Apple    2
2     103        Xiomi    3

In [13]:
comp['BrandName']='9R 12Pro K20'.split() # adding new column 'BrandName' to comp datafrmae

In [10]:
comp

   Cmp_id Company Name  Pid BrandName
0     101      Oneplus    1        9R
1     102        Apple    2     12Pro
2     103        Xiomi    3       K20

In [14]:
comp.to_excel('NewComp.xlsx',sheet_name='NewSheet') # saving modified comp dataframe as new excel file

### Copy Dataframe
We could have copied the comp dataframe and then applied the operations on copied dataframe

In [20]:
copy_comp = comp        # simply assigning the comp dataframe to a variable

but the drawback of this is that if we do some changes in copied dataframe, those change also gets reflected to original dataframe. To overcome this, we use **DataFrame.copy()** method

In [21]:
copy_comp

   Cmp_id Company Name  Pid BrandName
0     101      Oneplus    1        9R
1     102        Apple    2     12Pro
2     103        Xiomi    3       K20

### DataFrame.copy()
Syntax: **DataFrame.copy(deep=True)**
When deep=True (default), a new object will be created with a copy of the calling objects data and indices. Modifications to the data or indices of the copy will not be reflected in the original object (see notes below).

When deep=False, a new object will be created without copying the calling objects data or index (only references to the data and index are copied). Any changes to the data of the original will be reflected in the shallow copy (and vice versa).

### HTML and SQL
For reading an html/sql file from the web we should have **sqlalchemy, lxml , html5lib, BeautifulSoup4** libraries installed first, using pip or conda.

In [34]:
import pandas as pd
#reading html page from web 
page_link = "https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/"
df = pd.read_html(page_link)
df[0].head() #just returns the top n rows of a table, default n=5

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
1,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
2,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
3,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020",10535
4,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019",10534

In [6]:
type(df)

list

# PANDAS EXERCISE - 01
In this example we are going to use [SF Salaries Dataset(https://www.kaggle.com/kaggle/sf-salaries)] from Kaggle.

In [5]:
#import pandas
import pandas as pd

In [6]:
#Reading Dataset 
sal = pd.read_csv('Salaries.csv')

In [7]:
#Checking the head of Dataframe
sal.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.00,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966.02,245131.88,137811.38,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739.13,106088.18,16452.60,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916.00,56120.71,198306.90,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134401.60,9737.00,182234.59,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [8]:
# Using info() method to find out how many rntries there are
sal.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [9]:
# Average BasePay
sal['BasePay'].mean()

66325.4488404877

In [10]:
# Amount of OvertimePay in the dataset
sal['OvertimePay'].max()

245131.88

In [11]:
# Job title of JOSEPH DRISCOLL
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['JobTitle']

24    CAPTAIN, FIRE SUPPRESSION
Name: JobTitle, dtype: object

In [12]:
# How much does JOSEPH DRISCOLL make (including Benefits)
sal[sal['EmployeeName']=='JOSEPH DRISCOLL']['TotalPayBenefits']

24    270324.91
Name: TotalPayBenefits, dtype: float64

In [13]:
# Name of highest paid person (including Benefits)
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].max()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411.18,0.0,400184.25,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN

In [14]:
sal[sal['TotalPayBenefits'] == sal['TotalPayBenefits'].min()]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.0,0.0,-618.13,0.0,-618.13,-618.13,2014,NaN,San Francisco,NaN

In [15]:
#average(mean) BasePay of all employees per year (2011-2014)
sal.groupby('Year').mean()['BasePay']

Year
2011    63595.956517
2012    65436.406857
2013    69630.030216
2014    66564.421924
Name: BasePay, dtype: float64

In [16]:
# Unique job titles
sal['JobTitle'].nunique()

2159

In [17]:
# Top five most common jobs
sal['JobTitle'].value_counts().head(5)

Transit Operator                7036
Special Nurse                   4389
Registered Nurse                3736
Public Svc Aide-Public Works    2518
Police Officer 3                2421
Name: JobTitle, dtype: int64

In [18]:
# Job titles were represented by only one person in 2013 (e.g: Job Titles with only one occurence in 2013?)
sum(sal[sal['Year'] == 2013]['JobTitle'].value_counts() == 1)

202

In [30]:
# How many people have the word Cheif in their job title?
#def cheif_string(jobtitle):
 #title = list(jobtitle)
  #if 'chief' in title.lower():
   #return True
    #else:
     #   return False

In [31]:
jobs = sal["JobTitle"].tolist()
chiefs = list(filter(lambda x: 'CHIEF' in x.upper(), jobs))

In [32]:
len(chiefs)

627

In [40]:
# **Bonus: Is there a correlation between length of the JOb Title string and Salary
sal['Title_len'] = sal['JobTitle'].apply(len)

In [41]:
sal[['Title_len','TotalPayBenefits']].corr() #No correlation

                  Title_len  TotalPayBenefits
Title_len          1.000000         -0.036878
TotalPayBenefits  -0.036878          1.000000

# PANDAS EXERCISE - 02
In this example we are going to use Ecommerce Purchases csv

In [43]:
# Import pandas and read in the Ecommerce Purchases csv file and set it to DataFrame 'ecom' and check its head
import pandas as pd
ecom = pd.read_csv('Ecommerce Purchases')
ecom.head(5)

,Address,Lot,AM or PM,Browser Info,Company,Credit Card,CC Exp Date,CC Security Code,CC Provider,Email,Job,IP Address,Language,Purchase Price
0,"16629 Pace Camp Apt. 448\nAlexisborough, NE 77...",46 in,PM,Opera/9.56.(X11; Linux x86_64; sl-SI) Presto/2...,Martinez-Herman,6011929061123406,02/20,900,JCB 16 digit,pdunlap@yahoo.com,"Scientist, product/process development",149.146.147.205,el,98.14
1,"9374 Jasmine Spurs Suite 508\nSouth John, TN 8...",28 rn,PM,Opera/8.93.(Windows 98; Win 9x 4.90; en-US) Pr...,"Fletcher, Richards and Whitaker",3337758169645356,11/18,561,Mastercard,anthony41@reed.com,Drilling engineer,15.160.41.51,fr,70.73
2,Unit 0065 Box 5052\nDPO AP 27450,94 vE,PM,Mozilla/5.0 (compatible; MSIE 9.0; Windows NT ...,"Simpson, Williams and Pham",675957666125,08/19,699,JCB 16 digit,amymiller@morales-harrison.com,Customer service manager,132.207.160.22,de,0.95
3,"7780 Julia Fords\nNew Stacy, WA 45798",36 vm,PM,Mozilla/5.0 (Macintosh; Intel Mac OS X 10_8_0 ...,"Williams, Marshall and Buchanan",6011578504430710,02/24,384,Discover,brent16@olson-robinson.info,Drilling engineer,30.250.74.19,es,78.04
4,"23012 Munoz Drive Suite 337\nNew Cynthia, TX 5...",20 IE,AM,Opera/9.58.(X11; Linux x86_64; it-IT) Presto/2...,"Brown, Watson and Andrews",6011456623207998,10/25,678,Diners Club / Carte Blanche,christopherwright@gmail.com,Fine artist,24.140.33.94,es,77.82

In [44]:
# How many rows and columns are there in ecom
ecom.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 14 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Address           10000 non-null  object
 1   Lot               10000 non-null  object
 2   AM or PM          10000 non-null  object
 3   Browser Info      10000 non-null  object
 4   Company           10000 non-null  object
 5   Credit Card       10000 non-null  int64
 6   CC Exp Date       10000 non-null  object
 7   CC Security Code  10000 non-null  int64
 8   CC Provider       10000 non-null  object
 9   Email             10000 non-null  object
 10  Job               10000 non-null  object
 11  IP Address        10000 non-null  object
 12  Language          10000 non-null  object
 13  Purchase Price    10000 non-null  float64
dtypes: float64(1), int64(2), object(11)
memory usage: 1.1+ MB

In [46]:
#What is the average Purchase Price
ecom['Purchase Price'].mean()

50.347302

In [47]:
# What were the highest and lowest purchase prices
ecom['Purchase Price'].max()

99.99

In [48]:
ecom['Purchase Price'].min()

0.0

In [59]:
# How many people have English 'en' as their Language of choice on the website
ecom[ecom['Language']=='en']['Language'].count()

1098

In [64]:
# How many people have the job title of 'Lawyer'
ecom[ecom['Job']=='Lawyer']['Job'].count()

30

In [69]:
# how many people made the purchase during the AM and how many people made the purchase during PM
ecom['AM or PM'].value_counts()

PM    5068
AM    4932
Name: AM or PM, dtype: int64

In [78]:
# What are the 5 most common Job Title?
ecom['Job'].value_counts().head()

Interior and spatial designer        31
Lawyer                               30
Social researcher                    28
Research officer, political party    27
Purchasing manager                   27
Name: Job, dtype: int64

In [81]:
# Someone made a purchase that came from Lot: "90 WT", what was the Purchase price of this transaction
ecom[ecom['Lot'] == '90 WT']['Purchase Price']

513    75.1
Name: Purchase Price, dtype: float64

In [82]:
# What is the email of the person with the following CreditCard Number : 4926535242672853
ecom[ecom['Credit Card'] == 4926535242672853 ]['Email']

1234    bondellen@williams-garza.com
Name: Email, dtype: object

In [84]:
# How many people have American Express as their Credit Card Provider and make a purchase above 95
ecom[(ecom['CC Provider'] == 'American Express') & (ecom['Purchase Price'] > 95)].count()

Address             39
Lot                 39
AM or PM            39
Browser Info        39
Company             39
Credit Card         39
CC Exp Date         39
CC Security Code    39
CC Provider         39
Email               39
Job                 39
IP Address          39
Language            39
Purchase Price      39
dtype: int64

In [99]:
# How many people have a credit card that expires in 2025
sum(ecom['CC Exp Date'].apply(lambda x : x[3:]=='25'))

1033

In [110]:
# What are the top 5 most popular email providers/hosts.
ecom['Email'].apply(lambda mail: mail.split('@')[1]).value_counts().head()

hotmail.com     1638
yahoo.com       1616
gmail.com       1605
smith.com         42
williams.com      37
Name: Email, dtype: int64

## Thank You!!!!!